### Sales Insights With Power BI

#### About the Data

* Downloaded dataset from the webiste WWW.Kaggle.com
* Five different datasets
* Like sales/marketing and customers data.
* Includes many products and two different product types (Own Brand & Distribution).
* Also, includes many different customers/clients like nomad stores, electric stores, surge stores etc..

**Objective:** 
* To analyze the data and discover insights from the provided data which helps in making data-driven decisions.
* Like finding the weakest areas that needs to be focused (location wise, zone wise etc..), finding total revenue and total profit, and forecasting which helps to take decisions for future budget planning.

In [1]:
# importing libraries
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

%matplotlib inline

In [2]:
# round to 2 decimals
pd.options.display.float_format = "{:.2f}".format

### Load all the data

In [3]:
transactions = pd.read_csv("transactions.csv")

In [4]:
products = pd.read_csv("products.csv")

In [5]:
markets = pd.read_csv("markets.csv")

In [6]:
customers = pd.read_csv("customers.csv")

In [7]:
date = pd.read_csv("date.csv")

### Transactions

In [8]:
transactions.head()

,product_code,customer_code,market_code,order_date,sales_qty,sales_amount,currency
0,Prod001,Cus001,Mark001,2017-10-10,100,41241.00,INR
1,Prod001,Cus002,Mark002,2018-05-08,3,-1.00,INR
2,Prod002,Cus003,Mark003,2018-04-06,1,875.00,INR
3,Prod002,Cus003,Mark003,2018-04-11,1,583.00,INR
4,Prod002,Cus004,Mark003,2018-06-18,6,7176.00,INR

In [9]:
# check the data types
transactions.dtypes

product_code      object
customer_code     object
market_code       object
order_date        object
sales_qty          int64
sales_amount     float64
currency          object
dtype: object

In [10]:
# shape() function to check rows and columns
transactions.shape

(150283, 7)

In [11]:
# check the null values
transactions.isnull().sum()

product_code     0
customer_code    0
market_code      0
order_date       0
sales_qty        0
sales_amount     0
currency         0
dtype: int64

In [12]:
# check the sales_amount less than '0'
transactions[transactions["sales_amount"] <= 0].head()

,product_code,customer_code,market_code,order_date,sales_qty,sales_amount,currency
1,Prod001,Cus002,Mark002,2018-05-08,3,-1.00,INR
159,Prod010,Cus015,Mark006,2018-05-26,1,0.00,INR
196,Prod010,Cus003,Mark003,2019-04-30,1,0.00,INR
239,Prod011,Cus018,Mark002,2018-12-28,1,0.00,INR
282,Prod001,Cus002,Mark002,2018-05-08,3,-1.00,INR

In [13]:
# check the length of the rows
len(transactions[transactions["sales_amount"] <= 0])

1611

In [14]:
# drop the rows that are less than or equal to '0'
transactions.drop(transactions[transactions["sales_amount"] <= 0].index, inplace=True)

In [15]:
transactions.shape

(148672, 7)

In [16]:
# convert currency from USD to INR
transactions["currency"].unique()

array(['INR', 'USD'], dtype=object)

In [17]:
# convert to INR
transactions[transactions["currency"] == "USD"]

,product_code,customer_code,market_code,order_date,sales_qty,sales_amount,currency
5,Prod003,Cus005,Mark004,2017-11-20,59,500.00,USD
6,Prod003,Cus005,Mark004,2017-11-22,36,250.00,USD
286,Prod003,Cus005,Mark004,2017-11-20,59,500.00,USD
287,Prod003,Cus005,Mark004,2017-11-22,36,250.00,USD

In [18]:
transactions[transactions["currency"] == "USD"]["sales_amount"]

5     500.00
6     250.00
286   500.00
287   250.00
Name: sales_amount, dtype: float64

In [19]:
val = transactions[transactions["currency"] == "USD"].index
val

Int64Index([5, 6, 286, 287], dtype='int64')

In [20]:
for x in val:   
    transactions.at[x, "sales_amount"] = transactions.at[x, "sales_amount"]*75
    transactions.at[x, "currency"] = "INR"

In [21]:
transactions.loc[val]

,product_code,customer_code,market_code,order_date,sales_qty,sales_amount,currency
5,Prod003,Cus005,Mark004,2017-11-20,59,37500.00,INR
6,Prod003,Cus005,Mark004,2017-11-22,36,18750.00,INR
286,Prod003,Cus005,Mark004,2017-11-20,59,37500.00,INR
287,Prod003,Cus005,Mark004,2017-11-22,36,18750.00,INR

In [22]:
# Adding column Product Price

transactions["product_price"] = transactions["sales_amount"] / transactions["sales_qty"]
transactions.head()

,product_code,customer_code,market_code,order_date,sales_qty,sales_amount,currency,product_price
0,Prod001,Cus001,Mark001,2017-10-10,100,41241.00,INR,412.41
2,Prod002,Cus003,Mark003,2018-04-06,1,875.00,INR,875.00
3,Prod002,Cus003,Mark003,2018-04-11,1,583.00,INR,583.00
4,Prod002,Cus004,Mark003,2018-06-18,6,7176.00,INR,1196.00
5,Prod003,Cus005,Mark004,2017-11-20,59,37500.00,INR,635.59

In [23]:
# caculate profit percentage using product price

def profit_per(y):
    profit = 8
    
    if y > 4000:
        profit = 23
    elif y > 3000:
        profit = 19
    elif y > 2000:
        profit = 17
    elif y > 1000:
        profit = 15
    elif y > 500:
        profit = 13
    elif y > 100:
        profit = 11
    else:
        profit = 8
        
    return profit

In [24]:
transactions["profit_percentage"] = transactions["product_price"].apply(profit_per)

In [25]:
transactions.head()

,product_code,customer_code,market_code,order_date,sales_qty,sales_amount,currency,product_price,profit_percentage
0,Prod001,Cus001,Mark001,2017-10-10,100,41241.00,INR,412.41,11
2,Prod002,Cus003,Mark003,2018-04-06,1,875.00,INR,875.00,13
3,Prod002,Cus003,Mark003,2018-04-11,1,583.00,INR,583.00,13
4,Prod002,Cus004,Mark003,2018-06-18,6,7176.00,INR,1196.00,15
5,Prod003,Cus005,Mark004,2017-11-20,59,37500.00,INR,635.59,13

In [26]:
# now calculate original price which refers to product price

transactions["original_price"] = (transactions["product_price"] - (transactions["product_price"]*(transactions["profit_percentage"] / 100)))

In [27]:
transactions.head()

,product_code,customer_code,market_code,order_date,sales_qty,sales_amount,currency,product_price,profit_percentage,original_price
0,Prod001,Cus001,Mark001,2017-10-10,100,41241.00,INR,412.41,11,367.04
2,Prod002,Cus003,Mark003,2018-04-06,1,875.00,INR,875.00,13,761.25
3,Prod002,Cus003,Mark003,2018-04-11,1,583.00,INR,583.00,13,507.21
4,Prod002,Cus004,Mark003,2018-06-18,6,7176.00,INR,1196.00,15,1016.60
5,Prod003,Cus005,Mark004,2017-11-20,59,37500.00,INR,635.59,13,552.97

In [28]:
# To find 'profit' column

transactions['profit'] = transactions['product_price']*(transactions['profit_percentage'] / 100)

In [29]:
transactions.head()

,product_code,customer_code,market_code,order_date,sales_qty,sales_amount,currency,product_price,profit_percentage,original_price,profit
0,Prod001,Cus001,Mark001,2017-10-10,100,41241.00,INR,412.41,11,367.04,45.37
2,Prod002,Cus003,Mark003,2018-04-06,1,875.00,INR,875.00,13,761.25,113.75
3,Prod002,Cus003,Mark003,2018-04-11,1,583.00,INR,583.00,13,507.21,75.79
4,Prod002,Cus004,Mark003,2018-06-18,6,7176.00,INR,1196.00,15,1016.60,179.40
5,Prod003,Cus005,Mark004,2017-11-20,59,37500.00,INR,635.59,13,552.97,82.63

In [30]:
# calculate total profit

transactions["total_profit"] = (transactions['sales_qty'])*(transactions['product_price']*(transactions['profit_percentage'] / 100))

In [31]:
transactions.head()

,product_code,customer_code,market_code,order_date,sales_qty,sales_amount,currency,product_price,profit_percentage,original_price,profit,total_profit
0,Prod001,Cus001,Mark001,2017-10-10,100,41241.00,INR,412.41,11,367.04,45.37,4536.51
2,Prod002,Cus003,Mark003,2018-04-06,1,875.00,INR,875.00,13,761.25,113.75,113.75
3,Prod002,Cus003,Mark003,2018-04-11,1,583.00,INR,583.00,13,507.21,75.79,75.79
4,Prod002,Cus004,Mark003,2018-06-18,6,7176.00,INR,1196.00,15,1016.60,179.40,1076.40
5,Prod003,Cus005,Mark004,2017-11-20,59,37500.00,INR,635.59,13,552.97,82.63,4875.00

#### Verifying Values

In [32]:
transactions["sales_amount"].sum()

986676768.0

In [33]:
transactions["sales_qty"].sum()

2431634

In [34]:
transactions["total_profit"].sum()

137301039.1

In [35]:
transactions.shape

(148672, 12)

### Products

In [36]:
products.head()

  product_code product_type
0      Prod001    Own Brand
1      Prod002    Own Brand
2      Prod003    Own Brand
3      Prod004    Own Brand
4      Prod005    Own Brand

In [37]:
# returns unique elements of an array
products["product_type"].unique()

array(['Own Brand', 'Distribution'], dtype=object)

In [38]:
# returns the number of unique elements
products["product_code"].nunique()

279

In [39]:
# find length of each product type
len(products[products["product_type"] == "Own Brand"])

191

In [40]:
len(products[products["product_type"] == "Distribution"])

88

In [41]:
transactions["product_code"].nunique()

338

In [42]:
product_code1 = pd.Series(products['product_code'].unique())
product_code1.tail()

274    Prod275
275    Prod276
276    Prod277
277    Prod278
278    Prod279
dtype: object

In [43]:
product_code2 = pd.Series(transactions['product_code'].unique())
product_code2.tail()

333    Prod335
334    Prod336
335    Prod337
336    Prod338
337    Prod339
dtype: object

In [44]:
for x in range(279, 338, 1):
    products = products.append({"product_code": product_code2[x], "product_type": "Own Brand"}, ignore_index=True)

In [45]:
products["product_code"].nunique()

338

In [46]:
products.tail()

    product_code product_type
333      Prod335    Own Brand
334      Prod336    Own Brand
335      Prod337    Own Brand
336      Prod338    Own Brand
337      Prod339    Own Brand

In [47]:
transactions.shape

(148672, 12)

In [48]:
transactions1 = pd.merge(transactions, products, how="inner", on="product_code")
transactions1.head()

,product_code,customer_code,market_code,order_date,sales_qty,sales_amount,currency,product_price,profit_percentage,original_price,profit,total_profit,product_type
0,Prod001,Cus001,Mark001,2017-10-10,100,41241.00,INR,412.41,11,367.04,45.37,4536.51,Own Brand
1,Prod001,Cus001,Mark001,2017-10-10,100,41241.00,INR,412.41,11,367.04,45.37,4536.51,Own Brand
2,Prod002,Cus003,Mark003,2018-04-06,1,875.00,INR,875.00,13,761.25,113.75,113.75,Own Brand
3,Prod002,Cus003,Mark003,2018-04-11,1,583.00,INR,583.00,13,507.21,75.79,75.79,Own Brand
4,Prod002,Cus004,Mark003,2018-06-18,6,7176.00,INR,1196.00,15,1016.60,179.40,1076.40,Own Brand

In [49]:
transactions1.shape

(148672, 13)

### Customers

In [50]:
customers.head()

  customer_code    custmer_name   customer_type
0        Cus001    Surge Stores  Brick & Mortar
1        Cus002    Nomad Stores  Brick & Mortar
2        Cus003    Excel Stores  Brick & Mortar
3        Cus004  Surface Stores  Brick & Mortar
4        Cus005  Premium Stores  Brick & Mortar

In [51]:
# returns unique elements of an array
customers["customer_type"].unique()

array(['Brick & Mortar', 'E-Commerce'], dtype=object)

In [52]:
# returns the number of unique elements
customers["custmer_name"].nunique()

38

In [53]:
customers["customer_code"].nunique()

38

In [54]:
transactions1.shape

(148672, 13)

In [55]:
transactions2 = pd.merge(transactions1, customers, how="inner", on="customer_code")
transactions2.head()

,product_code,customer_code,market_code,order_date,sales_qty,sales_amount,currency,product_price,profit_percentage,original_price,profit,total_profit,product_type,custmer_name,customer_type
0,Prod001,Cus001,Mark001,2017-10-10,100,41241.00,INR,412.41,11,367.04,45.37,4536.51,Own Brand,Surge Stores,Brick & Mortar
1,Prod001,Cus001,Mark001,2017-10-10,100,41241.00,INR,412.41,11,367.04,45.37,4536.51,Own Brand,Surge Stores,Brick & Mortar
2,Prod013,Cus001,Mark001,2017-10-10,240,143560.00,INR,598.17,13,520.40,77.76,18662.80,Own Brand,Surge Stores,Brick & Mortar
3,Prod013,Cus001,Mark001,2017-10-10,240,143560.00,INR,598.17,13,520.40,77.76,18662.80,Own Brand,Surge Stores,Brick & Mortar
4,Prod016,Cus001,Mark001,2018-06-28,187,115481.00,INR,617.55,13,537.26,80.28,15012.53,Own Brand,Surge Stores,Brick & Mortar

In [56]:
transactions2.shape

(148672, 15)

### Markets

In [57]:
markets.head()

  markets_code markets_name     zone
0      Mark001      Chennai    South
1      Mark002       Mumbai  Central
2      Mark003    Ahmedabad    North
3      Mark004    Delhi NCR    North
4      Mark005       Kanpur    North

In [58]:
# change column names according to transactions table
markets = markets.rename(columns={"markets_code": "market_code", "markets_name": "market_name"})
markets.head()

  market_code market_name     zone
0     Mark001     Chennai    South
1     Mark002      Mumbai  Central
2     Mark003   Ahmedabad    North
3     Mark004   Delhi NCR    North
4     Mark005      Kanpur    North

In [59]:
markets["market_name"].unique()

array(['Chennai', 'Mumbai', 'Ahmedabad', 'Delhi NCR', 'Kanpur',
       'Bengaluru', 'Bhopal', 'Lucknow', 'Patna', 'Kochi', 'Nagpur',
       'Surat', 'Hyderabad', 'Bhubaneshwar'], dtype=object)

In [60]:
markets["market_name"].nunique()

14

In [61]:
markets["market_code"].nunique()

15

In [62]:
markets["zone"].nunique()

3

In [63]:
transactions["market_code"].nunique()

15

In [64]:
transactions2.shape

(148672, 15)

In [65]:
transactions3 = pd.merge(transactions2, markets, how="inner", on="market_code")
transactions3.head()

,product_code,customer_code,market_code,order_date,sales_qty,sales_amount,currency,product_price,profit_percentage,original_price,profit,total_profit,product_type,custmer_name,customer_type,market_name,zone
0,Prod001,Cus001,Mark001,2017-10-10,100,41241.00,INR,412.41,11,367.04,45.37,4536.51,Own Brand,Surge Stores,Brick & Mortar,Chennai,South
1,Prod001,Cus001,Mark001,2017-10-10,100,41241.00,INR,412.41,11,367.04,45.37,4536.51,Own Brand,Surge Stores,Brick & Mortar,Chennai,South
2,Prod013,Cus001,Mark001,2017-10-10,240,143560.00,INR,598.17,13,520.40,77.76,18662.80,Own Brand,Surge Stores,Brick & Mortar,Chennai,South
3,Prod013,Cus001,Mark001,2017-10-10,240,143560.00,INR,598.17,13,520.40,77.76,18662.80,Own Brand,Surge Stores,Brick & Mortar,Chennai,South
4,Prod016,Cus001,Mark001,2018-06-28,187,115481.00,INR,617.55,13,537.26,80.28,15012.53,Own Brand,Surge Stores,Brick & Mortar,Chennai,South

In [66]:
transactions3.shape

(148672, 17)

### Date

In [67]:
date.head()

         date     cy_date  year month_name date_yy_mmm
0  2017-06-01  2017-06-01  2017       June      17-Jun
1  2017-06-02  2017-06-01  2017       June      17-Jun
2  2017-06-03  2017-06-01  2017       June      17-Jun
3  2017-06-04  2017-06-01  2017       June      17-Jun
4  2017-06-05  2017-06-01  2017       June      17-Jun

In [68]:
date = date.rename(columns={"date": "order_date"})
date.head()

   order_date     cy_date  year month_name date_yy_mmm
0  2017-06-01  2017-06-01  2017       June      17-Jun
1  2017-06-02  2017-06-01  2017       June      17-Jun
2  2017-06-03  2017-06-01  2017       June      17-Jun
3  2017-06-04  2017-06-01  2017       June      17-Jun
4  2017-06-05  2017-06-01  2017       June      17-Jun

In [69]:
date["order_date"].nunique()

1126

In [70]:
transactions3["order_date"].nunique()

804

In [71]:
transactions3.shape

(148672, 17)

In [72]:
transactions4 = pd.merge(transactions3, date, how="inner", on="order_date")
transactions4.head()

,product_code,customer_code,market_code,order_date,sales_qty,sales_amount,currency,product_price,profit_percentage,original_price,...,total_profit,product_type,custmer_name,customer_type,market_name,zone,cy_date,year,month_name,date_yy_mmm
0,Prod001,Cus001,Mark001,2017-10-10,100,41241.00,INR,412.41,11,367.04,...,4536.51,Own Brand,Surge Stores,Brick & Mortar,Chennai,South,2017-10-01,2017,October,17-Oct
1,Prod001,Cus001,Mark001,2017-10-10,100,41241.00,INR,412.41,11,367.04,...,4536.51,Own Brand,Surge Stores,Brick & Mortar,Chennai,South,2017-10-01,2017,October,17-Oct
2,Prod013,Cus001,Mark001,2017-10-10,240,143560.00,INR,598.17,13,520.40,...,18662.80,Own Brand,Surge Stores,Brick & Mortar,Chennai,South,2017-10-01,2017,October,17-Oct
3,Prod013,Cus001,Mark001,2017-10-10,240,143560.00,INR,598.17,13,520.40,...,18662.80,Own Brand,Surge Stores,Brick & Mortar,Chennai,South,2017-10-01,2017,October,17-Oct
4,Prod020,Cus001,Mark001,2017-10-10,140,153019.00,INR,1092.99,15,929.04,...,22952.85,Own Brand,Surge Stores,Brick & Mortar,Chennai,South,2017-10-01,2017,October,17-Oct

In [73]:
transactions4.shape

(148672, 21)

### Save the Final Version of File

In [74]:
transactions4.to_csv("Final_Transactions_Data.csv", index=False)

In [75]:
df = pd.read_csv("Final_Transactions_Data.csv")

In [76]:
df.head()

,product_code,customer_code,market_code,order_date,sales_qty,sales_amount,currency,product_price,profit_percentage,original_price,...,total_profit,product_type,custmer_name,customer_type,market_name,zone,cy_date,year,month_name,date_yy_mmm
0,Prod001,Cus001,Mark001,2017-10-10,100,41241.00,INR,412.41,11,367.04,...,4536.51,Own Brand,Surge Stores,Brick & Mortar,Chennai,South,2017-10-01,2017,October,17-Oct
1,Prod001,Cus001,Mark001,2017-10-10,100,41241.00,INR,412.41,11,367.04,...,4536.51,Own Brand,Surge Stores,Brick & Mortar,Chennai,South,2017-10-01,2017,October,17-Oct
2,Prod013,Cus001,Mark001,2017-10-10,240,143560.00,INR,598.17,13,520.40,...,18662.80,Own Brand,Surge Stores,Brick & Mortar,Chennai,South,2017-10-01,2017,October,17-Oct
3,Prod013,Cus001,Mark001,2017-10-10,240,143560.00,INR,598.17,13,520.40,...,18662.80,Own Brand,Surge Stores,Brick & Mortar,Chennai,South,2017-10-01,2017,October,17-Oct
4,Prod020,Cus001,Mark001,2017-10-10,140,153019.00,INR,1092.99,15,929.04,...,22952.85,Own Brand,Surge Stores,Brick & Mortar,Chennai,South,2017-10-01,2017,October,17-Oct

In [77]:
df.shape

(148672, 21)

In [78]:
df["sales_amount"].sum()

986676768.0

In [79]:
transactions4.to_excel("Final_Data.xlsx")